Repository: rkrawczyk98/qms-mobile
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Quality Management System
pl: System Zarządzania Jakością

source: Settings
pl: Ustawienia

source: Dark Mode
pl: Tryb ciemny

# settingsTitle
source: Settings
pl: Ustawienia

source: Language
pl: Język

# selectLanguage
source: Select application language
pl: Wybierz język aplikacji

# themeLight
source: Light
pl: Jasny

# themeDark
source: Dark
pl: Ciemny

# themeSystem
source: System
pl: Systemowy

# languageEnglish
source: English
pl: Angielski

# languagePolish
source: Polish
pl: Polski

# loginLabel
source: Login
pl: Nazwa użytkownika

# loginHint
source: Enter your username
pl: Wprowadź nazwę użytkownika

# passwordLabel
source: Password
pl: Hasło

# passwordHint
source: Enter your password
pl: Wprowadź swoje hasło

source: Remember me
pl: Zapamiętaj mnie

# loginButton
source: Log In
pl: Zaloguj się

source: Light Theme
pl: Jasny Motyw

source: Dark Theme
pl: Ciemny Motyw

source: Theme
pl: Motyw

source: Loading...
pl: Ładowanie...

source: Login failed
pl: Logowanie nie powiodło się

source: Success!
pl: Sukces!

source: Operation failed!
pl: Operacja nie powiodła się!

source: Details
pl: Szczegóły

source: Error Details
pl: Szczegóły błędu

# message
source: Message: {message}
pl: Wiadomość: {message}

# errorCode
source: Error Code: {code}
pl: Kod błędu: {code}

source: Close
pl: Zamknij

# failedToConnect
source: Failed to connect to the server
pl: Nie udało się połączyć z serwerem

# unknownError
source: An unknown error occurred
pl: Wystąpił nieznany błąd

source: Welcome
pl: Witaj

source: Home
pl: Strona główna

source: Profile
pl: Profil

source: Log out
pl: Wyloguj

# logs
source: Error logs
pl: Logi błędów

# appLogs
source: Application Logs
pl: Logi aplikacji

# selectLogToView
source: Select a log file to view its contents
pl: Wybierz plik z logiem, aby zobaczyć jego zawartość

# confirmDeletion
source: Are you sure?
pl: Czy na pewno?

# deleteAllLogsMessage
source: Are you sure you want to delete all log files?
pl: Czy na pewno chcesz usunąć wszystkie pliki z logami?

source: Delete file
pl: Usuń plik

# deleteSingleLogMessage
source: Are you sure you want to delete this log file?
pl: Czy na pewno chcesz usunąć ten plik z logiem?

source: Cancel
pl: Anuluj

source: Delete
pl: Usuń

source: Notifications
pl: Powiadomienia

# manageNotifications
source: Manage push notifications in the app
pl: Zarządzaj powiadomieniami push w aplikacji

source: Manage Account
pl: Zarządzaj kontem

source: Go to account settings
pl: Przejdź do ustawień konta

source: About App
pl: Informacje o aplikacji

# aboutAppTitle
source: About the App
pl: O aplikacji

source: App Description
pl: Opis Aplikacji

# appDetails
source: QMS is an application designed for managing quality control within component deliveries. It enables monitoring and management of deliveries, components, and their statuses.
pl: QMS jest aplikacją przeznaczoną do zarządzania kontrolą jakości w ramach dostaw komponentów. Umożliwia ona monitorowanie i zarządzanie dostawami, komponentami oraz ich statusami.

# featuresTitle
source: Features:
pl: Funkcjonalności:

# featuresList
source: • Adding new deliveries and components • Tracking component status • Managing customers and component types • Automatic status updates for deliveries and components based on subcomponent statuses
pl: • Dodawanie nowych dostaw i komponentów • Śledzenie statusu komponentów • Zarządzanie klientami i typami komponentów • Automatyczne zmiany statusów dostaw oraz komponentów w opraciu o statusy podkomponentów

# authorTitle
source: Author:
pl: Autor:

# authorInfo
source: Rafał Krawczyk Index Number: 13950
pl: Rafał Krawczyk Numer indexu: 13950

# selectThemeMode
source: Choose app theme
pl: Wybierz motyw aplikacji

# changePasswordTitle
source: Change Password
pl: Zmień hasło

source: Current Password
pl: Bieżące hasło

source: New Password
pl: Nowe hasło

source: Enter Current Password
pl: Wprowadź bieżące hasło

source: Enter New Password
pl: Wprowadź nowe hasło

source: Change Password
pl: Zmień hasło

source: Password changed successfully.
pl: Hasło zostało pomyślnie zmienione.

source: Incorrect Current Password.
pl: Nieprawidłowe bieżące hasło.

source: User not found.
pl: Użytkownik nie został znaleziony.

# errorChangingPassword
source: An error occurred while changing password.
pl: Wystąpił błąd podczas zmiany hasła.

# changePasswordErrorInvalidCurrentPassword
source: Invalid current password.
pl: Nieprawidłowe bieżące hasło.

# changePasswordErrorUserNotFound
source: User not found.
pl: Użytkownik nie został znaleziony.

# changePasswordErrorGeneral
source: An error occurred while changing the password.
pl: Wystąpił błąd podczas zmiany hasła.

source: User Profile
pl: Profil użytkownika

# userProfileTitle
source: Your Information
pl: Twoje informacje

source: Username
pl: Nazwa użytkownika

source: Roles
pl: Role

source: Permissions
pl: Uprawnienia

source: Edit Profile
pl: Edytuj profil

source: No roles
pl: Brak ról

source: No permissions
pl: Brak uprawnień

source: No user logged in
pl: Brak zalogowanego użytkownika

# noEmail
source: No email address
pl: Brak adresu email

# homeTitle
source: Home
pl: Strona główna

source: User Management
pl: Zarządzanie użytkownikami

source: Delivery Management
pl: Zarządzanie dostawami

source: Customer Management
pl: Zarządzanie klientami

source: Component Management
pl: Zarządzanie komponentami

source: Warehouse Management
pl: Zarządzanie magazynem

source: Admin Panel
pl: Panel administracyjny

source: Add User
pl: Dodaj użytkownika

# manageRolesPermissions
source: Manage Roles and Permissions
pl: Zarządzaj rolami i uprawnieniami

# deliveryManagementTitle
source: Delivery Management
pl: Zarządzanie dostawami

source: Add Delivery
pl: Dodaj dostawę

source: Edit Delivery
pl: Edytuj dostawę

source: Delete Delivery
pl: Usuń dostawę

# manageAutoStatuses
source: Manage Automatic Statuses
pl: Zarządzaj automatycznymi statusami

# customerManagementTitle
source: Customer Management
pl: Zarządzanie klientami

source: Add Customer
pl: Dodaj klienta

source: Edit Customer
pl: Edytuj klienta

source: Delete Customer
pl: Usuń klienta

# componentManagementTitle
source: Component Management
pl: Zarządzanie komponentami

source: Add Component Type
pl: Dodaj typ komponentu

source: Edit Component Type
pl: Edytuj typ komponentu

source: Delete Component Type
pl: Usuń typ komponentu

source: Manage Subcomponents
pl: Zarządzaj podkomponentami

# warehouseManagementTitle
source: Warehouse Management
pl: Zarządzanie magazynem

source: Add Warehouse
pl: Dodaj magazyn

source: Manage Warehouses
pl: Zarządzaj magazynami

source: Delete Warehouse
pl: Usuń magazyn

# userAlreadyExists
source: A user with the name {username} already exists.
pl: Użytkownik o nazwie {username} już istnieje.

# unexpectedError
source: An unexpected error occurred.
pl: Wystąpił nieoczekiwany błąd.

# resetPasswordErrorGeneral
source: An error occurred while resetting the password.
pl: Wystąpił błąd podczas resetowania hasła.

# createUserTitle
source: Create New User
pl: Utwórz nowego użytkownika

source: Password
pl: Hasło

# createUserButton
source: Create User
pl: Utwórz użytkownika

source: User created successfully.
pl: Użytkownik został pomyślnie utworzony.

# resetPasswordErrorUserNotFound
source: User not found.
pl: Użytkownik nie został znaleziony.

source: Add Role
pl: Dodaj role

source: Add Permission
pl: Dodaj uprawnienie

source: Select Role
pl: Wybierz role

source: Select Permission
pl: Wybierz uprawnienie

source: Manage users
pl: Zarządzaj użytkownikami

# userManagementTitle
source: User Management
pl: Zarządzanie użytkownikami

source: Select User
pl: Wybierz użytkownika

# selectUserHint
source: Choose a user
pl: Wybierz użytkownika

source: User Roles
pl: Role użytkownika

# resetPasswordButton
source: Reset Password
pl: Zresetuj hasło

# deleteUserButton
source: Delete User
pl: Usuń użytkownika

# passwordResetSuccess
source: Password reset successfully.
pl: Hasło zostało pomyślnie zresetowane

# userDeletedSuccess
source: User deleted successfully.
pl: Użytkownik został pomyślnie usunięty

# deleteUserError
source: Failed to delete user.
pl: Nie udało się usunąć użytkownika

# roleCreated
source: Role successfully created.
pl: Rola została pomyślnie utworzona.

# roleUpdated
source: Role successfully updated.
pl: Rola została pomyślnie zaktualizowana.

# roleDeleted
source: Role successfully deleted.
pl: Rola została pomyślnie usunięta.

# permissionCreated
source: Permission successfully created.
pl: Uprawnienie zostało pomyślnie utworzone.

# permissionUpdated
source: Permission successfully updated.
pl: Uprawnienie zostało pomyślnie zaktualizowane.

# permissionDeleted
source: Permission successfully deleted.
pl: Uprawnienie zostało pomyślnie usunięte.

source: Enter Role Name
pl: Wprowadź nazwę roli

source: Enter Permission Name
pl: Wprowadź nazwę uprawnienia

source: Edit Role Name
pl: Edytuj nazwę roli

source: Edit Permission Name
pl: Edytuj nazwę uprawnienia

source: Role & Permission Management
pl: Zarządzanie rolami i uprawnieniami

source: Failed to load roles
pl: Nie udało się wczytać ról

source: No roles found.
pl: Nie znaleziono ról.

source: Failed to load permissions
pl: Nie udało się wczytać uprawnień

source: No permissions found.
pl: Nie znaleziono uprawnień.

# useCustomPassword
source: Assign a custom password
pl: Przypisz niestandardowe hasło

# enterNewUsername
source: Enter the new username
pl: Wpisz nazwę nowego użytkownika

source: Manage permissions
pl: Zarządzaj uprawnieniami

# confirmDeleteRole
source: Are you sure you want to delete the selected role?
pl: Czy na pewno chcesz usunać wybraną rolę?

# confirmDeletePermission
source: Are you sure you want to delete the selected permission?
pl: Czy na pewno chcesz usunać wybrane uprawnienie?

source: User Permissions
pl: Uprawnienia użytkownika

# passwordResetFailure
source: Failed to reset password.
pl: Nie udało się zresetować hasła.

# userDeletionFailure
source: Failed to delete user.
pl: Nie udało się usunąć użytkownika.

# confirmDeleteUser
source: Are you sure you want to delete this user?
pl: Czy na pewno chcesz usunąć tego użytkownika?

source: Reset password
pl: Zresetuj hasła

source: No users available.
pl: Brak dostępnych użytkowników.

source: Manage roles
pl: Zarządzaj rolami

source: Manage
pl: Zarządzaj

source: Search roles
pl: Szukaj ról

source: Search permissions
pl: Szukaj uprawnień

source: Reset
pl: Zresetuj

source: Session expired
pl: Sesja wygasła

source: Create Customer
pl: Utwórz klienta

source: Name
pl: Nazwa

source: Enter customer name
pl: Wprowadź nazwę klienta

source: Save
pl: Zapisz

# customerCreatedSuccess
source: Customer created successfully!
pl: Klient został pomyślnie utworzony!

# customerCreationFailed
source: Failed to create customer
pl: Nie udało się utworzyć klienta

source: Manage Customers
pl: Zarządzaj klientami

source: Customer ID
pl: ID klienta

source: Edit Customer Details
pl: Edytuj dane klienta

source: Confirm Delete
pl: Potwierdź usunięcie

# confirmDeleteCustomer
source: Are you sure you want to delete
pl: Czy na pewno chcesz usunąć?

# customerDeletedSuccess
source: Customer deleted successfully!
pl: Klient został pomyślnie usunięty!

# customerDeletionFailed
source: Failed to delete customer
pl: Nie udało się usunąć klienta

# customerUpdatedSuccess
source: Customer updated successfully!
pl: Klient zaktualizował pomyślnie!

# customerUpdateFailed
source: Failed to update customer
pl: Nie udało się zaktualizować klienta

source: No customers available.
pl: Brak dostępnych klientów.

source: Failed to load customers
pl: Nie udało się załadować klientów

# refreshSuccess
source: Refresh was successful!
pl: Odświeżanie powiodło się!

source: Add warehouse position
pl: Dodaj pozycje magazynową

source: Manage warehouse positions
pl: Zarządzaj pozycjami magazynowymi

source: Create Warehouse
pl: Utwórz Magazyn

source: Enter warehouse name
pl: Wprowadź nazwę magazynu

# warehouseCreatedSuccess
source: Warehouse created successfully!
pl: Magazyn został pomyślnie utworzony!

source: Edit Warehouse
pl: Edytuj Magazyn

source: Edit Warehouse Details
pl: Edytuj Szczegóły Magazynu

# warehouseUpdatedSuccess
source: Warehouse updated successfully!
pl: Magazyn został pomyślnie zaktualizowany!

source: No warehouses available.
pl: Brak dostępnych magazynów.

# warehouseDeletedSuccess
source: Warehouse deleted successfully!
pl: Magazyn został pomyślnie usunięty!

# confirmDeleteWarehouse
source: Are you sure you want to delete warehouse
pl: Czy na pewno chcesz usunąć magazyn

source: Create Warehouse Position
pl: Utwórz pozycję magazynową

# warehousePositionCreatedSuccess
source: Warehouse position created successfully!
pl: Pozycja magazynowa została pomyślnie utworzona!

source: Edit Warehouse Position
pl: Edytuj pozycję magazynową

source: Edit Warehouse Position Details
pl: Edytuj szczegóły pozycji magazynowej

# warehousePositionUpdatedSuccess
source: Warehouse position updated successfully!
pl: Pozycja magazynowa została pomyślnie zaktualizowana!

source: No warehouse positions available.
pl: Brak dostępnych pozycji magazynowych.

# confirmDeleteWarehousePosition
source: Are you sure you want to delete this warehouse position?
pl: Czy na pewno chcesz usunąć tę pozycję magazynową?

# warehousePositionDeletedSuccess
source: Warehouse position deleted successfully!
pl: Pozycja magazynowa została pomyślnie usunięta!

source: Enter warehouse position name
pl: Wprowadź nazwę pozycji magazynowej

source: Select Warehouse
pl: Wybierz magazyn

# warehouseID
source: Warehouse identifier
pl: Identyfikator magazynu

# selectWarehouseTooltip
source: Pick warehouse
pl: Wybierz magazyn

# createComponentTypeTitle
source: Create Component Type
pl: Utwórz Typ Komponentu

source: Component Type Name
pl: Nazwa Typu Komponentu

source: Prefix
pl: Prefiks

source: Sort Order
pl: Kolejność Sortowania

source: Subcomponents
pl: Subkomponenty

source: Subcomponent Name
pl: Nazwa Subkomponentu

source: Is Activity
pl: Czy to aktywność

source: Primary Statuses
pl: Statusy Pierwotne

source: Secondary Statuses
pl: Statusy Wtórne

source: Add Primary Status
pl: Dodaj Status Pierwotny

source: Add Secondary Status
pl: Dodaj Status Wtórny

source: Remove Subcomponent
pl: Usuń Subkomponent

source: Add Subcomponent
pl: Dodaj Subkomponent

source: Create Component Type
pl: Utwórz Typ Komponentu

# validationRequired
source: This field is required
pl: To pole jest wymagane

# validationNumber
source: This field must be a number
pl: To pole musi być liczbą

# successfullyCreatedComponentType
source: The component type was successfully created.
pl: Typ komponentu został pomyślnie utworzony.

# subcomponentNamePlaceholder
source: Subcomponent name
pl: Nazwa podkomponentu

source: Delivery list
pl: Lista dostaw

# deliveryDetailsTitle
source: Delivery Details
pl: Szczegóły Dostawy

source: Delivery Number
pl: Nr dostawy

source: Component Type
pl: Typ komponentów

source: Client
pl: Klient

source: Delivery Date
pl: Data dostawy

# createdByUser
source: Created By
pl: Utworzono przez

# deliveryHistoryTitle
source: Delivery History
pl: Historia dostawy

# noDeliveryHistory
source: No delivery history found.
pl: Nie znaleziono historii dostawy.

# errorLoadingDelivery
source: Error loading delivery details.
pl: Błąd podczas ładowania szczegółów dostawy.

source: Delivery not found.
pl: Nie znaleziono dostawy.

source: Unknown
pl: Nieznany

source: Customer
pl: Klient

# deliveryAddedSuccess
source: The delivery has been successfully added!
pl: Dostawa została pomyślnie dodana!

# deliveryAddError
source: Error adding delivery.
pl: Błąd podczas dodawania dostawy.

# selectComponentTypeError
source: Please select a component type.
pl: Proszę wybrać typ komponentu.

# selectCustomerError
source: Please select a customer.
pl: Proszę wybrać klienta.

# selectDeliveryDateError
source: Please select a delivery date.
pl: Proszę wybrać datę dostawy.

source: Contents
pl: Zawartość

# fetchErrorComponentTypes
source: Failed to fetch component types.
pl: Nie udało się pobrać typów komponentów.

# fetchErrorCustomers
source: Failed to fetch customers.
pl: Nie udało się pobrać klientów.

source: No component types available.
pl: Brak dostępnych typów komponentów.

# enterCustomerNameError
source: Please enter a valid customer name
pl: Proszę wprowadzić poprawną nazwę klienta

# customerCreationError
source: Failed to create customer. Please try again.
pl: Nie udało się utworzyć klienta. Spróbuj ponownie.

# customerUpdateError
source: Failed to update customer. Please try again.
pl: Nie udało się zaktualizować klienta. Spróbuj ponownie.

# refreshError
source: Failed to refresh customers.
pl: Wystąpił błąd podczas odświeżania.

# customerDeleteError
source: Failed to delete the customer. Please try again.
pl: Nie udało się usunąć klienta. Spróbuj ponownie.

source: Create Delivery Status
pl: Utwórz Status Dostawy

source: Add Delivery Status
pl: Dodaj Status Dostawy

source: Delivery Status Name
pl: Nazwa Statusu Dostawy

source: Enter delivery status name
pl: Wprowadź nazwę statusu dostawy

# enterDeliveryStatusNameError
source: Please enter a delivery status name
pl: Proszę wprowadzić nazwę statusu dostawy

# deliveryStatusCreatedSuccess
source: Delivery status created successfully
pl: Status dostawy został pomyślnie utworzony

# deliveryStatusCreationError
source: Failed to create delivery status
pl: Nie udało się utworzyć statusu dostawy

source: Manage delivery statuses
pl: Zarządzanie statusami dostawy

source: No delivery statuses available.
pl: Brak dostępnych statusów dostawy.

# confirmDeleteDeliveryStatus
source: Are you sure you want to delete the delivery status?
pl: Czy na pewno chcesz usunąć status dostawy

# deliveryStatusDeletedSuccess
source: The delivery status was successfully deleted.
pl: Status dostawy został pomyślnie usunięty.

# deliveryStatusDeleteError
source: Error deleting the delivery status.
pl: Błąd podczas usuwania statusu dostawy.

source: Edit delivery status
pl: Edytuj status dostawy

source: Edit delivery status details
pl: Edytuj szczegóły statusu dostawy

# deliveryStatusUpdatedSuccess
source: The delivery status was successfully updated.
pl: Status dostawy został pomyślnie zaktualizowany.

# deliveryStatusUpdateError
source: Error updating the delivery status.
pl: Błąd podczas aktualizacji statusu dostawy.

# fetchErrorDeliveryStatuses
source: Error fetching statuses delivery.
pl: Błąd podczas pobierania statusów dostawy.

source: Lists
pl: Listy

source: Component List
pl: Lista komponentów

# administration
source: Application Administration
pl: Administracja aplikacją

source: Other
pl: Inne

source: Manage Deliveries
pl: Zarządzanie dostawami

source: Browse
pl: Przeglądaj

source: Create
pl: Utwórz

source: No deliveries found.
pl: Nie znaleziono żadnej dostawy.

source: Last Modified
pl: Ostatnia zmiana

source: None
pl: Brak

# nameSubmitInfo
source: To confirm the name, type it into the text field and click the confirmation button.
pl: Aby zaakceptować nazwę, wpisz ją w pole tekstowe, a następnie kliknij przycisk zatwierdzenia.

# unsavedChangesTitle
source: Unsaved Changes
pl: Niezapisane zmiany

# lossOfUnsavedData
source: Your unsaved changes have been lost.
pl: Niezapisane zmiany zostały utracone.

source: Discard Changes
pl: Odrzuć zmiany

source: Warning
pl: Ostrzeżenie

# info
source: Information
pl: Informacja

source: Unnamed Subcomponent
pl: Nienazwany podkomponent

# manageComponentTypeTitle
source: Manage Component Type
pl: Zarządzaj Typem Komponentu

# selectComponentType
source: Select a Component Type
pl: Wybierz Typ Komponentu

source: Update Component Name
pl: Zaktualizuj Nazwę Typu Komponentu

source: Update Subcomponents
pl: Zaktualizuj Podkomponenty

# successfullyUpdatedComponentName
source: Component name updated successfully
pl: Nazwa typu komponentu została pomyślnie zaktualizowana

# successfullyUpdatedSubcomponents
source: Subcomponents updated successfully
pl: Podkomponenty zostały pomyślnie zaktualizowane

source: Failed to load component types
pl: Nie udało się załadować typów komponentów

source: Failed to fetch subcomponents
pl: Nie udało się pobrać podkomponentów

source: Failed to update component name
pl: Nie udało się zaktualizować nazwy typu komponentu

source: Failed to update subcomponents
pl: Nie udało się zaktualizować podkomponentów

source: Manage Components
pl: Zarządzaj Komponentami

source: No components found.
pl: Nie znaleziono żadnych komponentów.

source: Type
pl: Typ

source: Not Available
pl: Brak Danych

source: Add Component
pl: Dodaj Komponent

source: Component Number
pl: Numer Komponentu

source: Component Size
pl: Rozmiar Komponentu

source: Control Date
pl: Data Kontroli

source: Production Date
pl: Data Produkcji

source: Component added successfully!
pl: Komponent został pomyślnie dodany!

# componentAddError
source: Error adding component
pl: Błąd przy dodawaniu komponentu

source: Select delivery
pl: Wybierz dostawę

source: Filter deliveries
pl: Filtruj dostawy

# validationInvalidNumber
source: Invalid number
pl: Nieprawidłowy numer

source: Filter by type
pl: Filtruj po typie

source: Component Details
pl: Szczegóły Komponentu

source: Component not found.
pl: Nie znaleziono komponentu.

# componentInfo
source: Component Information
pl: Informacje o Komponencie

source: Created By
pl: Utworzony przez

source: Size
pl: Rozmiar

# noSubcomponents
source: No subcomponents available.
pl: Brak dostępnych podkomponentów.

source: Status updated successfully.
pl: Status został pomyślnie zaktualizowany.

# statusUpdateError
source: Failed to update status.
pl: Nie udało się zaktualizować statusu.

# errorLoadingStatuses
source: Error loading subcomponent statuses.
pl: Błąd podczas ładowania statusów subkomponentów

source: Edit Component
pl: Edytuj Komponent

# componentUpdated
source: Component updated successfully!
pl: Komponent został zaktualizowany pomyślnie!

# componentUpdateError
source: Error updating component
pl: Błąd podczas aktualizacji komponentu

# requiredField
source: This field is required
pl: To pole jest wymagane

# generalInfo
source: General Information
pl: Informacje ogólne

source: Dates
pl: Daty

source: Save Changes
pl: Zapisz zmiany

source: Shipping Date
pl: Data wysyłki

source: Scrapped Date
pl: Data złomowania

# componentNameOne
source: Component Name (1)
pl: Nazwa komponentu (1)

# componentNameTwo
source: Component Name (2)
pl: Nazwa komponentu (2)

source: Outside Number
pl: Numer zewnętrzny

source: WZ Number
pl: Numer WZ

# statusLoadingError
source: Error loading statuses
pl: Błąd podczas ładowania statusów

source: Clear date
pl: Wyczyść date

source: Delivery Contents
pl: Zawartość Dostawy

# noComponentsForDelivery
source: No components available for the selected delivery
pl: Brak komponentów dla wybranej dostawy

# addComponentTooltip
source: Click to add a component to this delivery.
pl: Kliknij, aby dodać komponent do tej dostawy.

source: Add New Component
pl: Dodaj Nowy Komponent

source: Warehouse
pl: Magazyn

source: Warehouse Position
pl: Pozycja Magazynowa

source: Error loading components
pl: Błąd podczas ładowania komponentów

source: Edit
pl: Edytuj

source: Delivery status
pl: Data dostawy
